<a id="11"></a> <br>
# What is the Pandas?:

Pandas is an open source library for Python programming language that provides high-performance, easy-to-use data structures and data analysis tools. It is used to open '.csv' and '.txt' files and to easily reach the desired result by reading the data contained in it. In other words, thanks to Pandas, we can open an excel file and select a column or row in it and process it. The process of shaping the data made in the Numpy library can be used in more detail.
With Pandas, you can do many things you can think of successfully and with a few lines of code. For example, the data of the image of the first black hole is arranged with pandas. Pandas is also optimized for speed and can operate very quickly.


Let's start with import first

Pandas Python proqramlaşdırma dili üçün açıq mənbəli kitabxanadır və yüksək performanslı, istifadəsi asan məlumat strukturları və məlumat təhlili alətləri təqdim edir. clipboard, csv, excel, feather, fwf, gbq, hdf, html, json, orc, parquet, pickle, sas, spss, sql, sql_query, sql_table, stata, table, xml fayl sonluqlu faylları açmaq və içindəki məlumatları oxumaqla istənilən nəticəyə asanlıqla çatmaq üçün istifadə olunur. Başqa sözlə desək, Pandas ilə biz excel faylını açıb oradan sütun və ya sətir seçib onlarla işləyə bilirik. Numpy kitabxanasında hazırlanmış dataların formalaşdırılması prosesində Pandas -ı daha müfəssəl formada istifadə edilə bilərik. Pandas ilə siz ağlınıza gələ biləcək bir çox şeyi uğurla və bir neçə sətir kodla edə bilərsiniz. Məsələn, ilk qara dəliyin təsvirinin məlumatları pandalarla düzülüb. Pandalar da sürət üçün optimallaşdırılıb və çox tez işləyə bilir.

In [1]:
import pandas as pd

In [2]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [4]:
h=['read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml']
k=[d.replace("read_","") for d in h]
for m in k:
    print(m,end=", ")

clipboard, csv, excel, feather, fwf, gbq, hdf, html, json, orc, parquet, pickle, sas, spss, sql, sql_query, sql_table, stata, table, xml,

<a id="12"></a> <br>
# Pandas Series:

The series are very similar to them since they are created based on the Numpy sequences. The series is a one-dimensional data structure consisting of tagged data. Label values ​​are called index. The data itself can consist of numbers, strings, or other Python objects. Lists, sequences or dictionaries can be used to create the series. Pandas Series take the following variables.


Pandas series has 4 parameters.
These are data, index, dtype, copy
you may not know dtype and copy of these
dtype is for data type. if None, data type will be inferred
Copy is Cpoy data :D
Copy is important. If you are going to make changes to the data, make a copy. You don't want to change the actual data



Here, too, you see the answer to the question "How to create a series?"

In [43]:
Label_list = ['I','am','Learning','Data','Science']
Data_List = [1,2,3,4,5]
Pd_Series1 = pd.Series(Data_List,Label_list)
Pd_Series1

I           1
am          2
Learning    3
Data        4
Science     5
dtype: int64

You can do this shorter like this

In [44]:
data = np.array(['a','b','c','d'])
Series = pd.Series(data,[100,101,102,103])
Series

100    a
101    b
102    c
103    d
dtype: object

Let's create 3 Series and apply some processing on these series.

In [45]:
DataDict = {'Michael_s exam result': 35, 'Olivia_s exam result': 85}
A = pd.Series(DataDict)
DataDict2 = {'Michael_s exam result': 44}
B = pd.Series(DataDict2)
DataDict3 = {'Darth_Vader_s exam result' :99}
C = pd.Series(DataDict3)

In [46]:
A

Michael_s exam result    35
Olivia_s exam result     85
dtype: int64

In [47]:
B

Michael_s exam result    44
dtype: int64

In [48]:
C

Darth_Vader_s exam result    99
dtype: int64


As you can see, we created 3 series. In some transactions we can use queue.

In [49]:
A + B

Michael_s exam result    79.0
Olivia_s exam result      NaN
dtype: float64


The first of these situations: four operations and more can be done between the two series. However, there is one thing you should be aware of: While the values ​​of 'Michael' and 'Olivia' are included in the 'A' value, only 'Michael' has the examination result of 'B' value. When we process the two values, only matching values ​​are processed. If there is a value that does not match (the 'Olivia' person in this example), that value will appear as 'NaN'.
And 'NaN'means 'Not a Number'

In [50]:
DataDict4 = C.append(A)
DataDict4

Darth_Vader_s exam result    99
Michael_s exam result        35
Olivia_s exam result         85
dtype: int64


As seen above, we created a value called "DataDict4", added the value "A" to the "C" value, and we were able to see the exam results of all three people. If 'Darth Vader' has received such a high score, it is probably an exam related to the 'dark side of power'. :)

In [51]:
A['Michael_s exam result']

35

In [52]:
C['Darth_Vader_s exam result']

99


Let me explain the code above immediately. 'Michael' and 'Olivia' people with 'A' value had exam results. Let's say we want to learn the exam result of 'Michael'. In this case, we need to write the first code. The same is true for the 'Darth Vader' character. This does not necessarily have to be a numerical value (int or float). It could also be a string of words, that is, words.
The "Series" issue is so short and concise now let's move on to the "DataFrame" topic.

<a id="13"></a> <br>
# DataFrame creation and functions:


We will do many operations with dataframes. Here, the columns are called 'Column' or 'Feature' and the rows are called 'row' or 'index'.
First of all, we have to create a data for ourselves. Isn't it easy?

Let's produce our first data and learn how to choose columns

In [53]:
from numpy.random import randn
df = pd.DataFrame(data = randn(5,5), index = ['A','B','C','D','E'], columns = ['Columns1','Columns2','Columns3','Columns4','Columns5'])
df

   Columns1  Columns2  Columns3  Columns4  Columns5
A  0.147207  1.431009  0.573086  0.491400  0.134344
B  1.973502  1.493159 -1.046506 -0.340613  1.522025
C  0.337196  0.166502  0.279811  0.859284 -0.406596
D -0.866759  0.745735 -0.755706  2.038098 -0.596819
E  0.830552 -1.054423  1.231616  0.649414  0.761890

you can even select more than one column, not just 1 column.

In [54]:
df[['Columns1','Columns5']]

   Columns1  Columns5
A  0.147207  0.134344
B  1.973502  1.522025
C  0.337196 -0.406596
D -0.866759 -0.596819
E  0.830552  0.761890


We do the process of adding a new column as follows.

In [55]:
df['Columns6'] = pd.Series(randn(5),['A','B','C','D','E'])
df

   Columns1  Columns2  Columns3  Columns4  Columns5  Columns6
A  0.147207  1.431009  0.573086  0.491400  0.134344  1.143336
B  1.973502  1.493159 -1.046506 -0.340613  1.522025 -0.360441
C  0.337196  0.166502  0.279811  0.859284 -0.406596  1.465242
D -0.866759  0.745735 -0.755706  2.038098 -0.596819  0.530597
E  0.830552 -1.054423  1.231616  0.649414  0.761890 -1.487814


You can also apply any operation to the column or row you want.

In [56]:
df['Columns7'] = (df['Columns6'] + df['Columns4'] - df['Columns1'] ) / df['Columns2'] * df['Columns3']
df

   Columns1  Columns2  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  1.431009  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502  1.493159 -1.046506 -0.340613  1.522025 -0.360441  1.874508
C  0.337196  0.166502  0.279811  0.859284 -0.406596  1.465242  3.339753
D -0.866759  0.745735 -0.755706  2.038098 -0.596819  0.530597 -3.481389
E  0.830552 -1.054423  1.231616  0.649414  0.761890 -1.487814  1.949416


For example, we created the 'Column7' value above and synchronized it to a value created by various columns, and such a table was created.
Can we add "Column" or not?

In [57]:
df.drop('Columns2', axis = 1, inplace = True)
df

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502 -1.046506 -0.340613  1.522025 -0.360441  1.874508
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
D -0.866759 -0.755706  2.038098 -0.596819  0.530597 -3.481389
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416


'The default value of axis is 0. and '0' rows represent '1' columns. The 'inplace' parameter here is important. It determines whether this operation is permanent and when we say 'True' it permanently assigns.



We can assign a 'Column' value as index title as follows.


df.set_index('Columns name', inplace = True)

In [58]:
df.index.names

FrozenList([None])

In [59]:
df.columns.names

FrozenList([None])


Now let's learn the status of 'loc' and 'iloc'.


When we use this code, it gives us the 'Column' values ​​in the 'C' line.

In [60]:
df.loc['C']

Columns1    0.337196
Columns3    0.279811
Columns4    0.859284
Columns5   -0.406596
Columns6    1.465242
Columns7    3.339753
Name: C, dtype: float64

In [61]:
df.loc['A']

Columns1    0.147207
Columns3    0.573086
Columns4    0.491400
Columns5    0.134344
Columns6    1.143336
Columns7    0.595721
Name: A, dtype: float64

In [62]:
df.iloc[0]

Columns1    0.147207
Columns3    0.573086
Columns4    0.491400
Columns5    0.134344
Columns6    1.143336
Columns7    0.595721
Name: A, dtype: float64


focus on the difference between these 2 codes. Did you find it?


The 'iloc' function extracts the 'Column' values ​​according to the index of the line, and the indices of the lines proceed from 0 as you know. The index of "A" is 0, and "0" is given to the "iloc" function. So these two functions actually represent the same thing. While you need to specify a name in the "loc" function, you need to specify an index in "iloc".


if you are looking for very special data, you can do it this way

In [63]:
df.loc['A','Columns5']

0.1343438516448686

In [64]:
df.loc[['A','Columns5'] and ['B','Columns4']]

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

          Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
B         1.973502 -1.046506 -0.340613  1.522025 -0.360441  1.874508
Columns4       NaN       NaN       NaN       NaN       NaN       NaN


As it turns out, it can be used in expressions like ‘or, 'and' above.


we can call and look at multiple columns and rows. Our topic here is over, next is 'DataFrame Filtering operations'.

In [65]:
df.loc[['A','D'],['Columns4','Columns2']]

/opt/conda/lib/python3.6/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Columns4  Columns2
A  0.491400       NaN
D  2.038098       NaN

<a id="14"></a> <br>
# DataFrame Filtering Operations:


we use it when we want to find or get the value of our data at certain intervals. If you wish, let's remember our data and start with simple operations.

In [66]:
df

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502 -1.046506 -0.340613  1.522025 -0.360441  1.874508
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
D -0.866759 -0.755706  2.038098 -0.596819  0.530597 -3.481389
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416


And let's move on to simple operations.

In [67]:
df > 0.2

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A     False      True      True     False      True      True
B      True     False     False      True     False      True
C      True      True      True     False      True      True
D     False     False      True     False      True     False
E      True      True      True      True     False      True

In [68]:
booleanDF = df > 0
booleanDF

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A      True      True      True      True      True      True
B      True     False     False      True     False      True
C      True      True      True     False      True      True
D     False     False      True     False      True     False
E      True      True      True      True     False      True


We can explain 'Boolean' as follows. Returns the value of 'False' if the desired value (if it is bigger than '0') satisfies the condition if it is not 'True'.

In [69]:
df[booleanDF]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502       NaN       NaN  1.522025       NaN  1.874508
C  0.337196  0.279811  0.859284       NaN  1.465242  3.339753
D       NaN       NaN  2.038098       NaN  0.530597       NaN
E  0.830552  1.231616  0.649414  0.761890       NaN  1.949416


Here, 'NaN' values ​​represent 'False' values ​​in the above Boolean value.

In [70]:
df[df > 0.5]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A       NaN  0.573086       NaN       NaN  1.143336  0.595721
B  1.973502       NaN       NaN  1.522025       NaN  1.874508
C       NaN       NaN  0.859284       NaN  1.465242  3.339753
D       NaN       NaN  2.038098       NaN  0.530597       NaN
E  0.830552  1.231616  0.649414  0.761890       NaN  1.949416


Here it shows the ones larger than '0.5' in 'df'. Those who are 'False' are again shown as 'NaN'. We will explain this later with better examples.

In [71]:
df['Columns1'] > 0

A     True
B     True
C     True
D    False
E     True
Name: Columns1, dtype: bool


Above you see the filtering of a certain 'Column' value. Below you can see it applied to every 'Column' value. In some, the result is different. Some have 4 lines, some have 2 lines, why do you think it might be?

In [72]:
df[df['Columns3']> 0]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416

In [73]:
df[df['Columns4']> 0]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
D -0.866759 -0.755706  2.038098 -0.596819  0.530597 -3.481389
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416

In [74]:
df[df['Columns5']> 0]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502 -1.046506 -0.340613  1.522025 -0.360441  1.874508
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416

In [75]:
df[df['Columns1']> 0]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502 -1.046506 -0.340613  1.522025 -0.360441  1.874508
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416


To summarize, values ​​that values are 'True' are shown. For example, there are 4 lines in 'Column4' which means that line 5 is 'True'.

In [76]:
df[(df['Columns1']> 0) & (df['Columns3']> 0)]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416

In [77]:
df[(df['Columns1']> 0) & (df['Columns3']> 0)]

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416


You can see various filtering exercises above. '&' Sign means 'and' and '|' sign means 'or'. If you use 'and' or 'or' instead of these signs, you will get an error. '&' Sign is made with 'SHIFT' and '6' keys and '|' sign is made with 'ALT GR' and '-'.

In [78]:
df

   Columns1  Columns3  Columns4  Columns5  Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  1.143336  0.595721
B  1.973502 -1.046506 -0.340613  1.522025 -0.360441  1.874508
C  0.337196  0.279811  0.859284 -0.406596  1.465242  3.339753
D -0.866759 -0.755706  2.038098 -0.596819  0.530597 -3.481389
E  0.830552  1.231616  0.649414  0.761890 -1.487814  1.949416

In [79]:
df['Columns6'] = ['NewValue1','NewValue2','NewValue3','NewValue4','NewValue5']
df

   Columns1  Columns3  Columns4  Columns5   Columns6  Columns7
A  0.147207  0.573086  0.491400  0.134344  NewValue1  0.595721
B  1.973502 -1.046506 -0.340613  1.522025  NewValue2  1.874508
C  0.337196  0.279811  0.859284 -0.406596  NewValue3  3.339753
D -0.866759 -0.755706  2.038098 -0.596819  NewValue4 -3.481389
E  0.830552  1.231616  0.649414  0.761890  NewValue5  1.949416


As you can see, you can give 'string' value

In [80]:
df.set_index('Columns6' , inplace = True)
df

           Columns1  Columns3  Columns4  Columns5  Columns7
Columns6
NewValue1  0.147207  0.573086  0.491400  0.134344  0.595721
NewValue2  1.973502 -1.046506 -0.340613  1.522025  1.874508
NewValue3  0.337196  0.279811  0.859284 -0.406596  3.339753
NewValue4 -0.866759 -0.755706  2.038098 -0.596819 -3.481389
NewValue5  0.830552  1.231616  0.649414  0.761890  1.949416

In [81]:
df.index.names

FrozenList(['Columns6'])

In [82]:
df.columns.names

FrozenList([None])


In the first line above, we have permanently assigned the index name 'Column6'. In the 2nd line, we inquired about the title of the index. In the last code, it queries the column name with the same logic and returns 'None' because we cannot assign it.

<a id="15"></a> <br>
# Defining DataFrames as Multi Index:


Multi index, as the name implies, is used in cases where there is a large number of indexes and is grouped as a basis.

In [83]:
OuterIndex = ['Group1','Group1','Group1','Group2','Group2','Group2','Group3','Group3','Group3']
InnerIndex = ['Index1','Index2','Index3','Index1','Index2','Index3','Index1','Index2','Index3']
list(zip(OuterIndex,InnerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [84]:
hierarchy = list(zip(OuterIndex,InnerIndex))
hierarchy = pd.MultiIndex.from_tuples(hierarchy)
hierarchy

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [85]:
df = pd.DataFrame(randn(9,3),hierarchy,columns = ['Column1','Colum2','Column3'])
df

                Column1    Colum2   Column3
Group1 Index1 -1.816691  2.238560  0.414793
       Index2 -0.147647 -0.556999  0.767274
       Index3 -1.219413 -0.008245 -1.186013
Group2 Index1 -0.518657  0.472449 -1.205321
       Index2 -0.454844  1.151974 -2.468956
       Index3  0.513007 -1.114757 -0.200094
Group3 Index1 -0.593100 -0.080408  0.263853
       Index2  0.055648  0.716449 -1.864696
       Index3  0.459192 -0.080693  0.583150


In the 1st code, we created 2 indexes and combined them with the 'zip' function. We used the list to do this, but you can use 'Tuple' and 'Dict'. In the 2nd code, we synchronized this to 'hierarchy'. Then, we created Multi index with 'pd.MultiIndex.from_tuples ()' feature. In the last code, we assigned random values ​​with the 'rand ()' function and provided the column information. And as we have seen, we obtained Multi Index DataFrame with 'Group', 'Index' and 'Column' values.

In [86]:
df['Column1']

Group1  Index1   -1.816691
        Index2   -0.147647
        Index3   -1.219413
Group2  Index1   -0.518657
        Index2   -0.454844
        Index3    0.513007
Group3  Index1   -0.593100
        Index2    0.055648
        Index3    0.459192
Name: Column1, dtype: float64

In [87]:
df.loc['Group1']

         Column1    Colum2   Column3
Index1 -1.816691  2.238560  0.414793
Index2 -0.147647 -0.556999  0.767274
Index3 -1.219413 -0.008245 -1.186013

In [88]:
df.loc[['Group1','Group2']]

                Column1    Colum2   Column3
Group1 Index1 -1.816691  2.238560  0.414793
       Index2 -0.147647 -0.556999  0.767274
       Index3 -1.219413 -0.008245 -1.186013
Group2 Index1 -0.518657  0.472449 -1.205321
       Index2 -0.454844  1.151974 -2.468956
       Index3  0.513007 -1.114757 -0.200094


As you can see above, you can call a certain part like this.

In [89]:
df.loc['Group1']

         Column1    Colum2   Column3
Index1 -1.816691  2.238560  0.414793
Index2 -0.147647 -0.556999  0.767274
Index3 -1.219413 -0.008245 -1.186013

In [90]:
df.loc[['Group1','Group2']]

                Column1    Colum2   Column3
Group1 Index1 -1.816691  2.238560  0.414793
       Index2 -0.147647 -0.556999  0.767274
       Index3 -1.219413 -0.008245 -1.186013
Group2 Index1 -0.518657  0.472449 -1.205321
       Index2 -0.454844  1.151974 -2.468956
       Index3  0.513007 -1.114757 -0.200094

In [91]:
df.loc['Group1'].loc['Index1']

Column1   -1.816691
Colum2     2.238560
Column3    0.414793
Name: Index1, dtype: float64


Values ​​such as 'Group', 'Column' and 'Index' can be called this way, and you can also call multiple and different types.

In [92]:
df.loc['Group1'].loc['Index1']['Column1']

-1.8166909020678856


For special data, you can handle your work with codes similar to the above.

In [93]:
df.index.names = ['Groups','Indexes']
df

                 Column1    Colum2   Column3
Groups Indexes
Group1 Index1  -1.816691  2.238560  0.414793
       Index2  -0.147647 -0.556999  0.767274
       Index3  -1.219413 -0.008245 -1.186013
Group2 Index1  -0.518657  0.472449 -1.205321
       Index2  -0.454844  1.151974 -2.468956
       Index3   0.513007 -1.114757 -0.200094
Group3 Index1  -0.593100 -0.080408  0.263853
       Index2   0.055648  0.716449 -1.864696
       Index3   0.459192 -0.080693  0.583150


Learning index names can also query columns.

In [94]:
df.xs('Group1') # df.xs('Group1') = df.loc['Group1']

          Column1    Colum2   Column3
Indexes
Index1  -1.816691  2.238560  0.414793
Index2  -0.147647 -0.556999  0.767274
Index3  -1.219413 -0.008245 -1.186013


Let's talk a little about the 'xs' function. You see that it is equal to a code we know above. The 'xs' function can perform functional functions such as 'loc', 'iloc', and it also provides us good advantages.

In [95]:
df.xs('Group1').xs('Index1')

Column1   -1.816691
Colum2     2.238560
Column3    0.414793
Name: Index1, dtype: float64

In [96]:
df.xs('Group1').xs('Index1').xs('Column1')

-1.8166909020678856


Before the first code, 'Group' and then 'Index' value are given. Because the 'xs' function 'Group', 'Index' works respectively. This explains it in second code


The advantage of the 'xs' function is as follows

In [97]:
df.xs('Index1', level = 'Indexes')

         Column1    Colum2   Column3
Groups
Group1 -1.816691  2.238560  0.414793
Group2 -0.518657  0.472449 -1.205321
Group3 -0.593100 -0.080408  0.263853

In [98]:
df.xs('Index1', level = 'Indexes')['Column1']

Groups
Group1   -1.816691
Group2   -0.518657
Group3   -0.593100
Name: Column1, dtype: float64